*> SPDX-License-Identifier: GPL-3.0-or-later
*> Copyright (C) 2020 Eric Herman <eric@freesa.org>

IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

PROCEDURE DIVISION.
   DISPLAY 'hello, world'.
STOP RUN.
